{"weightsManifest": [{"weights": [{"name": "block1_conv1/kernel", "dtype": "float32", "shape": [3, 3, 3, 64]}, {"name": "block1_conv1/bias", "dtype": "float32", "shape": [64]}, {"name": "block1_conv2/kernel", "dtype": "float32", "shape": [3, 3, 64, 64]}, {"name": "block1_conv2/bias", "dtype": "float32", "shape": [64]}, {"name": "block2_conv1/kernel", "dtype": "float32", "shape": [3, 3, 64, 128]}, {"name": "block2_conv1/bias", "dtype": "float32", "shape": [128]}, {"name": "block2_conv2/kernel", "dtype": "float32", "shape": [3, 3, 128, 128]}, {"name": "block2_conv2/bias", "dtype": "float32", "shape": [128]}, {"name": "block3_conv1/kernel", "dtype": "float32", "shape": [3, 3, 128, 256]}, {"name": "block3_conv1/bias", "dtype": "float32", "shape": [256]}, {"name": "block3_conv2/kernel", "dtype": "float32", "shape": [3, 3, 256, 256]}, {"name": "block3_conv2/bias", "dtype": "float32", "shape": [256]}, {"name": "block3_conv3/kernel", "dtype": "float32", "shape": [3, 3, 256, 256]}, {"name": "block3_conv3/bias", "dtype": "float32", "shape": [256]}, {"name": "block4_conv1/kernel", "dtype": "float32", "shape": [3, 3, 256, 512]}, {"name": "block4_conv1/bias", "dtype": "float32", "shape": [512]}, {"name": "block4_conv2/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "block4_conv2/bias", "dtype": "float32", "shape": [512]}, {"name": "block4_conv3/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "block4_conv3/bias", "dtype": "float32", "shape": [512]}, {"name": "block5_conv1/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "block5_conv1/bias", "dtype": "float32", "shape": [512]}, {"name": "block5_conv2/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "block5_conv2/bias", "dtype": "float32", "shape": [512]}, {"name": "block5_conv3/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "block5_conv3/bias", "dtype": "float32", "shape": [512]}, {"name": "fc1/kernel", "dtype": "float32", "shape": [25088, 4096]}, {"name": "fc1/bias", "dtype": "float32", "shape": [4096]}, {"name": "fc2/kernel", "dtype": "float32", "shape": [4096, 4096]}, {"name": "fc2/bias", "dtype": "float32", "shape": [4096]}, {"name": "predictions/kernel", "dtype": "float32", "shape": [4096, 1000]}, {"name": "predictions/bias", "dtype": "float32", "shape": [1000]}], "paths": ["group1-shard1of132", "group1-shard2of132", "group1-shard3of132", "group1-shard4of132", "group1-shard5of132", "group1-shard6of132", "group1-shard7of132", "group1-shard8of132", "group1-shard9of132", "group1-shard10of132", "group1-shard11of132", "group1-shard12of132", "group1-shard13of132", "group1-shard14of132", "group1-shard15of132", "group1-shard16of132", "group1-shard17of132", "group1-shard18of132", "group1-shard19of132", "group1-shard20of132", "group1-shard21of132", "group1-shard22of132", "group1-shard23of132", "group1-shard24of132", "group1-shard25of132", "group1-shard26of132", "group1-shard27of132", "group1-shard28of132", "group1-shard29of132", "group1-shard30of132", "group1-shard31of132", "group1-shard32of132", "group1-shard33of132", "group1-shard34of132", "group1-shard35of132", "group1-shard36of132", "group1-shard37of132", "group1-shard38of132", "group1-shard39of132", "group1-shard40of132", "group1-shard41of132", "group1-shard42of132", "group1-shard43of132", "group1-shard44of132", "group1-shard45of132", "group1-shard46of132", "group1-shard47of132", "group1-shard48of132", "group1-shard49of132", "group1-shard50of132", "group1-shard51of132", "group1-shard52of132", "group1-shard53of132", "group1-shard54of132", "group1-shard55of132", "group1-shard56of132", "group1-shard57of132", "group1-shard58of132", "group1-shard59of132", "group1-shard60of132", "group1-shard61of132", "group1-shard62of132", "group1-shard63of132", "group1-shard64of132", "group1-shard65of132", "group1-shard66of132", "group1-shard67of132", "group1-shard68of132", "group1-shard69of132", "group1-shard70of132", "group1-shard71of132", "group1-shard72of132", "group1-shard73of132", "group1-shard74of132", "group1-shard75of132", "group1-shard76of132", "group1-shard77of132", "group1-shard78of132", "group1-shard79of132", "group1-shard80of132", "group1-shard81of132", "group1-shard82of132", "group1-shard83of132", "group1-shard84of132", "group1-shard85of132", "group1-shard86of132", "group1-shard87of132", "group1-shard88of132", "group1-shard89of132", "group1-shard90of132", "group1-shard91of132", "group1-shard92of132", "group1-shard93of132", "group1-shard94of132", "group1-shard95of132", "group1-shard96of132", "group1-shard97of132", "group1-shard98of132", "group1-shard99of132", "group1-shard100of132", "group1-shard101of132", "group1-shard102of132", "group1-shard103of132", "group1-shard104of132", "group1-shard105of132", "group1-shard106of132", "group1-shard107of132", "group1-shard108of132", "group1-shard109of132", "group1-shard110of132", "group1-shard111of132", "group1-shard112of132", "group1-shard113of132", "group1-shard114of132", "group1-shard115of132", "group1-shard116of132", "group1-shard117of132", "group1-shard118of132", "group1-shard119of132", "group1-shard120of132", "group1-shard121of132", "group1-shard122of132", "group1-shard123of132", "group1-shard124of132", "group1-shard125of132", "group1-shard126of132", "group1-shard127of132", "group1-shard128of132", "group1-shard129of132", "group1-shard130of132", "group1-shard131of132", "group1-shard132of132"]}], "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "vgg16", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block1_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "block1_pool", "trainable": true}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 128, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 128, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "block2_pool", "trainable": true}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block3_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 256, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block3_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 256, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block3_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 256, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block3_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "block3_pool", "trainable": true}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv1", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block4_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 512, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv2", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block4_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 512, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv3", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block4_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 512, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block4_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "block4_pool", "trainable": true}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv1", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block5_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 512, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv2", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block5_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 512, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv3", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "block5_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "activation": "relu", "use_bias": true, "filters": 512, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block5_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "block5_pool", "trainable": true}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten", "config": {"data_format": "channels_last", "name": "flatten", "trainable": true}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc1", "config": {"kernel_regularizer": null, "bias_regularizer": null, "name": "fc1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "units": 4096, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc2", "config": {"kernel_regularizer": null, "bias_regularizer": null, "name": "fc2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "units": 4096, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "predictions", "config": {"kernel_regularizer": null, "bias_regularizer": null, "name": "predictions", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "units": 1000, "bias_constraint": null, "kernel_constraint": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "output_layers": [["predictions", 0, 0]]}}, "keras_version": "2.2.2"}}